Onizuka09/STM32-Templates/STM32F401RETemplate_HAL/STM32_UART_HAL/Src/main.c
#include <stm32f401xe.h>
#include "main.h"

#include <stm32f4xx_hal_rcc.h>
#include <stm32f4xx_hal_uart.h>
#include <string.h>
#include <stm32f4xx_hal_gpio_ex.h>
#include "../../STM32_Template_HAL/CMSIS/STM32F4xx_HAL_Driver/Inc/stm32f4xx_hal_gpio_ex.h"

// #include "../../STM32_Template_HAL/CMSIS/STM32F4_Headers/stm32f401xc.h"
char buffer[4];
UART_HandleTypeDef huart2; 
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
int main(void)
{
  HAL_Init();
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  HAL_UART_Receive_IT(&huart2, (uint8_t *)buffer, sizeof(buffer));
  HAL_UART_Transmit(&huart2, (uint8_t *)"data\n\r", strlen("data\n\r"), HAL_MAX_DELAY);
  while (1)
  {
    
    // HAL_GPIO_TogglePin(LD2_GPIO_Port,LD2_Pin); 
    
    // HAL_GPIO_WritePin(GPIOA,GPIO_PIN_5,GPIO_PIN_SET);
    HAL_Delay(2000); 
  }
}
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON ;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}
static void MX_USART2_UART_Init(void)
{
    __HAL_RCC_GPIOA_CLK_ENABLE();
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_3;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  __HAL_RCC_USART2_CLK_ENABLE();  
  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  // __HAL_UART_ENABLE_IT(&huart2, UART_IT_RXNE);  // enable receive intterupts
  HAL_NVIC_SetPriority( USART2_IRQn  , 1, 0) ;
  HAL_NVIC_EnableIRQ( USART2_IRQn  ) ;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    Error_Handler();
  }
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
  if (huart->Instance == USART2)
  {
    HAL_UART_Transmit(&huart2, (uint8_t *)"data\n\r", strlen("data\n\r"), HAL_MAX_DELAY);
     HAL_UART_Receive_IT(&huart2, (uint8_t *)buffer, sizeof(buffer));
    HAL_GPIO_TogglePin(GPIOA,GPIO_PIN_5);
  }
}

void UART2_IRQHandler(void) {
         HAL_UART_Transmit(&huart2, (uint8_t *)"data\n\r", strlen("data\n\r"), HAL_MAX_DELAY);
     HAL_UART_Receive_IT(&huart2, (uint8_t *)buffer, sizeof(buffer));

  HAL_UART_IRQHandler(&huart2);
  // HAL_UART_Receive_IT(&huart2, (uint8_t *)buffer, sizeof(buffer));
    HAL_GPIO_TogglePin(GPIOA,GPIO_PIN_5);

  

}
static void MX_GPIO_Init(void)
{
    // __HAL_RCC_GPIOC_CLK_ENABLE();
  // __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  // __HAL_RCC_GPIOB_CLK_ENABLE();
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);
  GPIO_InitStruct.Pin = LD2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LD2_GPIO_Port, &GPIO_InitStruct);
}
void Error_Handler(void)
{
  __disable_irq();
  while (1)
  {
  }
}
#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
